Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1176/src/semc_nand_flash_MIMXRT1176.c
const uint8_t s_nandDeviceManufacturerList[][12] = { { 'M', 'I', 'C', 'R', 'O', 'N', ' ', ' ', ' ', ' ', ' ', ' ' },
                                                     { 'S', 'P', 'A', 'N', 'S', 'I', 'O', 'N', ' ', ' ', ' ', ' ' },
                                                     { 'S', 'A', 'M', 'S', 'U', 'N', 'G', ' ', ' ', ' ', ' ', ' ' },
                                                     { 'W', 'I', 'N', 'B', 'O', 'N', 'D', ' ', ' ', ' ', ' ', ' ' },
                                                     { 'H', 'Y', 'N', 'I', 'X', ' ', ' ', ' ', ' ', ' ', ' ', ' ' },
                                                     { 'T', 'O', 'S', 'H', 'I', 'B', 'A', ' ', ' ', ' ', ' ', ' ' },
                                                     { 'M', 'A', 'C', 'R', 'O', 'N', 'I', 'X', ' ', ' ', ' ', ' ' },
                                                     { 0 } };

////////////////////////////////////////////////////////////////////////////////
// Code
////////////////////////////////////////////////////////////////////////////////

static uint8_t semc_nand_get_specific_ac_cycles(semc_nand_config_t *config,
                                                nand_ac_cycle_set_option_t acSetOption,
                                                uint32_t requiredTime_ns,
                                                uint8_t bitWidth)
{
    uint8_t cycles;
    uint32_t baseClkInMHz;
    uint32_t baseTick_ps;
    uint32_t requiredTime_ps = requiredTime_ns * 1000;

    semc_clk_freq_t clkFreq = (semc_clk_freq_t)config->memConfig.asyncClkFreq;
    switch (clkFreq)
    {
        case kSemcClkFreq_33MHz:
            baseClkInMHz = 33;
            break;
        case kSemcClkFreq_108MHz:
            baseClkInMHz = 108;
            break;
        case kSemcClkFreq_133MHz:
            baseClkInMHz = 133;
            break;
        case kSemcClkFreq_166MHz:
            baseClkInMHz = 166;
            break;
        default:
        case kSemcClkFreq_66MHz:
            baseClkInMHz = 66;
            break;
    }

    // baseTick_ps is ipg_clk
    // if clkFreq = 166MHz, baseTick_ps = 6024 ps = 6.024 us
    baseTick_ps = 1000000 / baseClkInMHz;

    if (acSetOption == kNandAcCycleSetOption_Min)
    {
        // Note: From Design team, we need to always allocate at least 1-2ns more time
        //  for each AC parameter, besides the axi/ipg clock from CCM is not always accurate,
        //  So just to be safe, we allocate one more cycle here.
        // while (((cycles + 1) * baseTick_ps) < requiredTime_ps)
        cycles = 0;
        while ((cycles * baseTick_ps) < requiredTime_ps)
        {
            cycles++;
        }

        if (cycles >= (1 << bitWidth))
        {
            cycles = (1 << bitWidth) - 1;
        }
    }
    else if (acSetOption == kNandAcCycleSetOption_Max)
    {
        cycles = (1 << bitWidth);
        while (cycles && ((cycles * baseTick_ps) > requiredTime_ps))
        {
            cycles--;
        }

        if (cycles >= 1)
        {
            cycles -= 1;
        }
    }

    return cycles;
}

/*  Set AC timing parameter*/
static void semc_nand_set_ac_timing_parameter(semc_nand_config_t *config, nand_ac_timing_set_option_t acSetOption)
{
    nand_ac_timing_parameter_cycle_t pAcTimingParameterCycle = s_nandAcTimingParameterTable[0];
    uint8_t acTimingTableIndex = config->acTimingTableIndex;

#if 0
    // Validate AC timing table index
    if (acTimingTableIndex > kNandAcTimingTableIndex_ONFI_1p0_FastestMode)
    {
        acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz;
        config->acTimingTableIndex = acTimingTableIndex;
    }
    // Validate User-Defined AC timing cycle
    else if (acTimingTableIndex == kNandAcTimingTableIndex_UserDefined)
    {
        bool isUserDefinedTimingValid = false;
        uint8_t *pAcTimingParameter = &config->memConfig.nandMemConfig.ceSetupTime;
        while (pAcTimingParameter <= &config->memConfig.nandMemConfig.asyncTurnaroundTime)
        {
            if (*pAcTimingParameter != 0)
            {
                isUserDefinedTimingValid = true;
            }
            pAcTimingParameter++;
        }
        if (isUserDefinedTimingValid)
        {
            if (s_nandOperationInfo.commandSet != kNandDeviceCmdSet_OnfiCompliant)
            {
                return;
            }
            else
            {
                if (acSetOption == kNandAcTimingSetOption_Advanced)
                {
                    s_nandOperationInfo.onfiAcTimingModeCode = config->userOnfiAcTimingModeCode;
                    return;
                }
            }
        }
        else
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz;
            config->acTimingTableIndex = acTimingTableIndex;
        }
    }
#endif

    if (s_nandOperationInfo.commandSet == kNandDeviceCmdSet_OnfiCompliant)
    {
        if (acSetOption == kNandAcTimingSetOption_Basic)
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz;
            pAcTimingParameterCycle = s_nandAcTimingParameterTable[acTimingTableIndex];
            // when select mode 4 and mode 5, toggle the edo mode before init.
            if ((config->acTimingTableIndex > kNandAcTimingTableIndex_ONFI_1p0_Mode3_33MHz) &&
                (config->acTimingTableIndex <= kNandAcTimingTableIndex_ONFI_1p0_Mode5_50MHz))
            {
                config->memConfig.nandMemConfig.edoMode = !config->memConfig.nandMemConfig.edoMode;
            }
            s_nandOperationInfo.onfiAcTimingModeCode = kNandDeviceFeature_ONFI_TimingModeCode_Mode0;
        }
        else if (acSetOption == kNandAcTimingSetOption_Advanced)
        {
            switch (config->acTimingTableIndex)
            {
                case kNandAcTimingTableIndex_ONFI_1p0_Mode5_50MHz:
                    s_nandOperationInfo.onfiAcTimingModeCode = kNandDeviceFeature_ONFI_TimingModeCode_Mode5;
                    break;
                case kNandAcTimingTableIndex_ONFI_1p0_Mode4_40MHz:
                    s_nandOperationInfo.onfiAcTimingModeCode = kNandDeviceFeature_ONFI_TimingModeCode_Mode4;
                    break;
                case kNandAcTimingTableIndex_ONFI_1p0_Mode3_33MHz:
                    s_nandOperationInfo.onfiAcTimingModeCode = kNandDeviceFeature_ONFI_TimingModeCode_Mode3;
                    break;
                case kNandAcTimingTableIndex_ONFI_1p0_Mode2_28MHz:
                    s_nandOperationInfo.onfiAcTimingModeCode = kNandDeviceFeature_ONFI_TimingModeCode_Mode2;
                    break;
                case kNandAcTimingTableIndex_ONFI_1p0_Mode1_20MHz:
                    s_nandOperationInfo.onfiAcTimingModeCode = kNandDeviceFeature_ONFI_TimingModeCode_Mode1;
                    break;
                case kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz:
                default:
                    s_nandOperationInfo.onfiAcTimingModeCode = kNandDeviceFeature_ONFI_TimingModeCode_Mode0;
                    break;
            }

            if ((config->acTimingTableIndex > kNandAcTimingTableIndex_ONFI_1p0_Mode3_33MHz) &&
                (config->acTimingTableIndex <= kNandAcTimingTableIndex_ONFI_1p0_Mode5_50MHz))
            {
                config->memConfig.nandMemConfig.edoMode = !config->memConfig.nandMemConfig.edoMode;
            }

            pAcTimingParameterCycle = s_nandAcTimingParameterTable[s_nandOperationInfo.onfiAcTimingModeCode + 1];
        }

        debug_printf("config->memConfig.nandMemConfig.edoMode = %d\n",
                     config->memConfig.nandMemConfig.edoMode); // 0-disable 1-enable
    }

    // Set AC timing cycle
    config->memConfig.nandMemConfig.ceSetupTime = pAcTimingParameterCycle.CES;
    config->memConfig.nandMemConfig.ceMinHoldTime = pAcTimingParameterCycle.CEH;
    config->memConfig.nandMemConfig.ceMinIntervalTime = pAcTimingParameterCycle.CEITV;
    config->memConfig.nandMemConfig.weLowTime = pAcTimingParameterCycle.WEL;
    config->memConfig.nandMemConfig.weHighTime = pAcTimingParameterCycle.WEH;
    config->memConfig.nandMemConfig.reLowTime = pAcTimingParameterCycle.REL;
    config->memConfig.nandMemConfig.reHighTime = pAcTimingParameterCycle.REH;
    config->memConfig.nandMemConfig.asyncTurnaroundTime = pAcTimingParameterCycle.TA;
    config->memConfig.nandMemConfig.weHighToReLowTime = pAcTimingParameterCycle.TWHR;
    config->memConfig.nandMemConfig.reHighToWeLowTime = pAcTimingParameterCycle.TRHW;
    config->memConfig.nandMemConfig.aleToDataStartTime = pAcTimingParameterCycle.TADL;
    config->memConfig.nandMemConfig.readyToReLowTime = pAcTimingParameterCycle.TRR;
    config->memConfig.nandMemConfig.weHighToBusyTime = pAcTimingParameterCycle.TWB;
}

static void semc_nand_adjust_timing_parameter_ccs(semc_nand_config_t *config)
{
    uint32_t changeColumnSetupInNs;

    // Reset specific tWHR parameter if needed
    if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
    {
        // Note: For AXI memory access, tWHR is tCCS in fact, and tCCS is not defined in ONFI timing mode table, it can
        // only be read from device by ReadParameterPage cmd
        changeColumnSetupInNs = (s_nandOperationInfo.changeColumnSetupTimeInNs_tCCS != 0) ?
                                    s_nandOperationInfo.changeColumnSetupTimeInNs_tCCS :
                                    NAND_FIRST_CMD_CHANGE_COLUMN_SETUP_TIME_NS;
        config->memConfig.nandMemConfig.weHighToReLowTime = semc_nand_get_specific_ac_cycles(
            config, kNandAcCycleSetOption_Max, changeColumnSetupInNs, kSemcMiscProperty_NAND_AcParameterBitWidth6b);
    }
}

static status_t semc_nand_switch_device_timing_mode(semc_nand_config_t *config)
{
    status_t status = kStatus_Success;

    if (s_nandOperationInfo.isFeatureCommandSupport)
    {
        // Set desired timing mode
        uint8_t deviceTimingMode;

        nand_onfi_feature_config_t featureConfig = {.command = kNandDeviceCmd_ONFI_SetFeatures,
                                                    .address = kNandDeviceFeature_ONFI_TimingModeAddress,
                                                    .parameter[0] = s_nandOperationInfo.onfiAcTimingModeCode,
                                                    .parameter[1] = 0,
                                                    .parameter[2] = 0,
                                                    .parameter[3] = 0 };

