Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1176/src/semc_nand_flash_MIMXRT1176.c
    // Set new SEMC NAND info
    // Note: We should never set io port according to ONFI parameter table, x8 is supported
    //   by all device, and some device support x16 as well. so we cannot set port mode to x16
    //   if device support it. port mode is always assigned by FUSE setting.
    // config->memConfig.nandMemConfig.ioPortWidth = (s_nandOnfiParameterConfig.supportedFeatures.x16bitDataBusWidth ==
    // 1) ? 16: 8;
    switch (s_nandOnfiParameterConfig.addressCycles)
    {
        case 0x22u:
            config->memConfig.nandMemConfig.arrayAddressOption = kSemcNandAddressOption_4byte_CA2RA2;
            break;
        case 0x21u:
            config->memConfig.nandMemConfig.arrayAddressOption = kSemcNandAddressOption_3byte_CA2RA1;
            break;
        case 0x13u:
            config->memConfig.nandMemConfig.arrayAddressOption = kSemcNandAddressOption_4byte_CA1RA3;
            break;
        case 0x12u:
            config->memConfig.nandMemConfig.arrayAddressOption = kSemcNandAddressOption_3byte_CA1RA2;
            break;
        case 0x11u:
            config->memConfig.nandMemConfig.arrayAddressOption = kSemcNandAddressOption_2byte_CA1RA1;
            break;
        case 0x23u:
        default:
            config->memConfig.nandMemConfig.arrayAddressOption = kSemcNandAddressOption_5byte_CA2RA3;
            break;
    }

    // Set new timing mode
    if (config->acTimingTableIndex == kNandAcTimingTableIndex_ONFI_1p0_FastestMode)
    {
        if (s_nandOnfiParameterConfig.timingMode.mode5)
        {
            config->acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode5_50MHz;
        }
        else if (s_nandOnfiParameterConfig.timingMode.mode4)
        {
            config->acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode4_40MHz;
        }
        else if (s_nandOnfiParameterConfig.timingMode.mode3)
        {
            config->acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode3_33MHz;
        }
        else if (s_nandOnfiParameterConfig.timingMode.mode2)
        {
            config->acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode2_28MHz;
        }
        else if (s_nandOnfiParameterConfig.timingMode.mode1)
        {
            config->acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode1_20MHz;
        }
        else
        {
            config->acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz;
        }
    }

    // Set Ready check interval time
    s_nandOperationInfo.pageReadTimeInUs_tR = ((uint32_t)s_nandOnfiParameterConfig.maxPageReadTimeInUs[1] << 8) +
                                              s_nandOnfiParameterConfig.maxPageReadTimeInUs[0];
    s_nandOperationInfo.blockEraseTimeInUs_tBERS = ((uint32_t)s_nandOnfiParameterConfig.maxBlockEraseTimeInUs[1] << 8) +
                                                   s_nandOnfiParameterConfig.maxBlockEraseTimeInUs[0];
    s_nandOperationInfo.PageProgramTimeInUs_tPROG =
        ((uint32_t)s_nandOnfiParameterConfig.maxPageProgramTimeInUs[1] << 8) +
        s_nandOnfiParameterConfig.maxPageProgramTimeInUs[0];

    // Actual ready check interval time = max operation time / 4;
    s_nandOperationInfo.pageReadTimeInUs_tR >>= 2;
    s_nandOperationInfo.blockEraseTimeInUs_tBERS >>= 2;
    s_nandOperationInfo.PageProgramTimeInUs_tPROG >>= 2;

    // Set change cloumn setup time for AXI access
    s_nandOperationInfo.changeColumnSetupTimeInNs_tCCS =
        ((uint32_t)s_nandOnfiParameterConfig.minChangeColunmSetupTimeInNs[1] << 8) +
        s_nandOnfiParameterConfig.minChangeColunmSetupTimeInNs[0];

    return status;
}

/*  Check the device ready status*/
status_t semc_nand_wait_for_ready(semc_nand_config_t *config,
                                  uint32_t readyCheckIntervalInUs,
                                  nand_ready_check_use_case_t useCaseOption)
{
    status_t status = kStatus_Success;
    bool isDeviceReady = false;
    uint64_t deltaTicks;
    uint64_t baseTicks = microseconds_get_ticks();
    uint64_t timeoutTicks = microseconds_convert_to_ticks(config->readyCheckTimeoutInMs * 1000);

    // Get SR value from Device by issuing READ STATUS commmand
    while (!isDeviceReady)
    {
        deltaTicks = microseconds_get_ticks() - baseTicks;
        if (deltaTicks > timeoutTicks)
        {
            return kStatus_SemcNAND_DeviceTimeout;
        }

        if (config->readyCheckOption == kSemcNandReadyCheckOption_SR)
        {
            uint8_t SR = 0;

            // As the AC cycle time unit of all NAND operations is us, so we don't
            //  need to check status continuously.
            microseconds_delay(readyCheckIntervalInUs);

            status = semc_nand_issue_read_status(config, &SR);
            if (status != kStatus_Success)
            {
                return status;
            }

            // SR[RDY] = 0, Busy
            // SR[RDY] = 1, Ready
            isDeviceReady = (SR & kNandDeviceSR_ONFI_ReadyBitMask);
        }
        // Monitors the target's R/B# signal to determine the progress.
        else if (config->readyCheckOption == kSemcNandReadyCheckOption_RB)
        {
            isDeviceReady = semc_is_nand_ready();
        }
    }

    if (useCaseOption == kNandReadyCheckUseCase_BeforeRead)
    {
        // Note: If the ReadStatus command is used to monitor for command completion, the
        //  ReadMode command must be used to re-enable data output mode.
        if (config->readyCheckOption == kSemcNandReadyCheckOption_SR)
        {
            // READ MODE command must be issued before starting folowing read cycles.
            status = semc_nand_issue_read_mode(config);
            if (status != kStatus_Success)
            {
                return status;
            }
        }
    }

    return kStatus_Success;
}

status_t semc_nand_issue_reset(semc_nand_config_t *config)
{
    status_t status = kStatus_Success;
    uint32_t dummyData = 0;

    // The RESET command may be executed with the target in any state.
    uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_Reset,
                                                          SEMC_IPCMD_NAND_AM_COL_ADDR_1BYTE, // Don't care
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ONLY);  // Command Only
    status =
        semc_ipg_command_nand_access(config->memConfig.nandMemConfig.ipgMemBaseAddress, commandCode, 0, &dummyData);

    // For ONFI 1.0 Timing mode 0, the max tRST = 1000us
    // For ONFI 1.O other timing modes, the max tRST = 5/10/500us
    //  The target is allowed a longer maximum reset time when a program or erase operation is in progress. The maximums
    //  correspond to:
    //    1. The target is not performing an erase or program operation.
    //    2. The target is performing a program operation.
    //    3. The target is performing an erase operation.
    status = semc_nand_wait_for_ready(config, NAND_MAX_RST_TIME3_tRST_US, kNandReadyCheckUseCase_DuringCommand);

