Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1176/src/semc_nand_flash_MIMXRT1176.c
    /*
     * after issuing read page command, read status(Optional) and read mode(Mandatory) operation shall be executed,
     * whether it be IPBUSCMD or AXI32CMD
     */
    status = semc_nand_wait_for_device_ready(config);

    return status;
}

status_t semc_nand_issue_read_page_spare(semc_nand_config_t *config, uint32_t ipgCmdAddr)
{
    status_t status = kStatus_Success;
    uint32_t readyCheckIntervalInUs;
    uint32_t dummyData = 0;

    // READ PAGE SPARE command is accepted by the device when it is ready (RDY = 1, ARDY = 1).
    status = semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL, kNandReadyCheckUseCase_DuringCommand);
    if (status != kStatus_Success)
    {
        return status;
    }

    uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_SPEC_ReadPageSpare,
                                                          SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Address value
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR); // Command Address
    status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Monitors the target's R/B# signal or Reads the status register
    //  to determine the progress of the page data transfer.
    readyCheckIntervalInUs = (config->readyCheckIntervalInUs > s_nandOperationInfo.pageReadTimeInUs_tR) ?
                                 config->readyCheckIntervalInUs :
                                 s_nandOperationInfo.pageReadTimeInUs_tR;
    status = semc_nand_wait_for_ready(config, readyCheckIntervalInUs, kNandReadyCheckUseCase_BeforeRead);

    return status;
}

status_t semc_nand_issue_change_read_column(semc_nand_config_t *config, uint32_t ipgCmdAddr)
{
    status_t status = kStatus_Success;
    uint32_t readyCheckIntervalInUs;
    uint32_t changeColumnSetupTimeInNs;
    uint32_t dummyData = 0;

    // CHANGE READ COLUMN command is accepted by the device when it is ready (RDY = 1, ARDY = 1).
    status = semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL, kNandReadyCheckUseCase_DuringCommand);
    if (status != kStatus_Success)
    {
        return status;
    }

    uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ChangeReadColumnSetup,
                                                          SEMC_IPCMD_NAND_AM_COL_ADDR_2BYTE, // 2 Byte-CA0/CA1
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR);  // Command Address
    status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ChangeReadColumnConfirm,
                                                 SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Don't care
                                                 SEMC_IPCMD_NAND_CM_IPG_CMD_HOLD); // Commmand Hold
    status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Note: The host shall not read data from the device until tCCS ns after the E0h(ChangeReadColumnConfirm) command
    // is written to the device.
    changeColumnSetupTimeInNs = (s_nandOperationInfo.changeColumnSetupTimeInNs_tCCS != 0) ?
                                    s_nandOperationInfo.changeColumnSetupTimeInNs_tCCS :
                                    NAND_FIRST_CMD_CHANGE_COLUMN_SETUP_TIME_NS;
    readyCheckIntervalInUs = (changeColumnSetupTimeInNs / 1000) + 1;
    microseconds_delay(readyCheckIntervalInUs);

    return status;
}

status_t semc_nand_issue_erase_block(semc_nand_config_t *config, uint32_t ipgCmdAddr)
{
    status_t status = kStatus_Success;
    uint32_t readyCheckIntervalInUs;
    uint32_t dummyData = 0;

    // ERASE BLOCK command is accepted by the device when it is ready (RDY = 1, ARDY = 1).
    status = semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL, kNandReadyCheckUseCase_DuringCommand);
    if (status != kStatus_Success)
    {
        return status;
    }

    // SA = blockIndex * pagesInBlock * pageDataSize;
    // CA = SA[COL-1:0], RA = SA[31:COL]
    uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_EraseBlockSetup,
                                                          SEMC_IPCMD_NAND_AM_ROW_ADDR_3BYTE, // Address value
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR);  // Command Address
    status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_EraseBlockConfirm,
                                                 SEMC_IPCMD_NAND_AM_ROW_ADDR_3BYTE, // Don't care
                                                 SEMC_IPCMD_NAND_CM_IPG_CMD_HOLD);  // Commmand Hold
    status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Monitors the target's R/B# signal or Reads the status register
    //  to determine the progress.
    readyCheckIntervalInUs = (config->readyCheckIntervalInUs > s_nandOperationInfo.blockEraseTimeInUs_tBERS) ?
                                 config->readyCheckIntervalInUs :
                                 s_nandOperationInfo.blockEraseTimeInUs_tBERS;
    status = semc_nand_wait_for_ready(config, readyCheckIntervalInUs, kNandReadyCheckUseCase_DuringCommand);

    return status;
}

status_t semc_nand_issue_program_page(semc_nand_config_t *config, uint32_t ipgCmdAddr, nand_program_process_t process)
{
    status_t status = kStatus_Success;
    uint16_t commandCode;
    uint32_t readyCheckIntervalInUs;
    uint32_t dummyData = 0;

    // SA = pageIndex * pageDataSize;
    // CA = SA[COL-1:0], RA = SA[31:COL]
    if (process == kNandDeviceProgramProcess_Pre)
    {
        // PROGRAM PAGE command is accepted by the device when it is ready (RDY = 1, ARDY = 1).
        status =
            semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL, kNandReadyCheckUseCase_DuringCommand);
        if (status != kStatus_Success)
        {
            return status;
        }
        commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ProgramPageSetup,
                                                     SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Address value
                                                     SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR); // Command Address
        status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    else if (process == kNandDeviceProgramProcess_Post)
    {
        commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ProgramPageConfirm,
                                                     SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Don't care
                                                     SEMC_IPCMD_NAND_CM_IPG_CMD_ONLY); // Commmand Only
        status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
        if (status != kStatus_Success)
        {
            return status;
        }
        // Monitors the target's R/B# signal or Reads the status register
        //  to determine the progress of the page data transfer.
        readyCheckIntervalInUs = (config->readyCheckIntervalInUs > s_nandOperationInfo.PageProgramTimeInUs_tPROG) ?
                                     config->readyCheckIntervalInUs :
                                     s_nandOperationInfo.PageProgramTimeInUs_tPROG;
        status = semc_nand_wait_for_ready(config, readyCheckIntervalInUs, kNandReadyCheckUseCase_DuringCommand);
        if (status != kStatus_Success)
        {
            return status;
        }
    }

    return kStatus_Success;
}

status_t semc_nand_set_device_ecc(semc_nand_config_t *config, semc_nand_device_ecc_status_t expectedStatus)
{
    status_t status;
    bool isEccSetAsExpected = false;

    if (config->deviceEccStatus == expectedStatus)
    {
        return kStatus_Success;
    }

    // Note: ECC is enabled by default in most ONFI compliant device,
    //  But for some Micron device, it is disabled by default
    if (config->vendorType == kSemcNandVendorType_Micron)
    {
        if (s_nandOperationInfo.isFeatureCommandSupport)
        {
            nand_onfi_feature_config_t featureConfig = {.command = kNandDeviceCmd_ONFI_SetFeatures,
                                                        .address = kNandDeviceFeature_MT29F_ArrayOperationModeAddress,
                                                        .parameter[1] = 0,
                                                        .parameter[2] = 0,
                                                        .parameter[3] = 0 };
            // Note:  Device ECC is disabled on power cycle.
            if (expectedStatus == kSemcNandDeviceEccStatus_Disabled)
            {
                featureConfig.parameter[0] = kNandDeviceFeature_MT29F_ArrayOperationModeCode_DisableECC;
            }
            else if (expectedStatus == kSemcNandDeviceEccStatus_Enabled)
            {
                featureConfig.parameter[0] = kNandDeviceFeature_MT29F_ArrayOperationModeCode_EnableECC;
            }

