Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1176/src/semc_nand_flash_MIMXRT1176.c
            /*
             * column address bits offset is bit0 if NANDCR0.PS=0(x8)
             * column address bits offset is bit1 if NANDCR0.PS=1(x16), bit0 is always 0. so address is twice.
             */
            if (config->memConfig.nandMemConfig.ioPortWidth == 16)
            {
                featureConfig.address = 0x120;
            }

            status = semc_nand_issue_access_feature(config, (uint8_t *)&featureConfig);
            if (status != kStatus_Success)
            {
                return status;
            }

            featureConfig.command = kNandDeviceCmd_ONFI_GetFeatures;
            featureConfig.parameter[0] = 0;
            status = semc_nand_issue_access_feature(config, (uint8_t *)&featureConfig);
            if (status != kStatus_Success)
            {
                return status;
            }

            if (featureConfig.parameter[0] == 0x08)
            {
                isEccSetAsExpected = true;
                config->deviceEccStatus = expectedStatus;
            }
            else
            {
                return kStatus_SemcNAND_SetInternalEccFailure;
            }
        }
    }

    if (!isEccSetAsExpected)
    {
        if (expectedStatus == kSemcNandDeviceEccStatus_Enabled)
        {
            return kStatus_SemcNAND_CannotEnableDeviceEcc;
        }
        else if (expectedStatus == kSemcNandDeviceEccStatus_Disabled)
        {
            return kStatus_SemcNAND_CannotDisableDeviceEcc;
        }
    }

    return kStatus_Success;
}

bool semc_nand_is_device_ecc_check_passed(semc_nand_config_t *config)
{
    bool isEccPassed = true;

    // Check NAND Device ECC status
    if ((config->enableEccCheck == kSemcNandEccCheckOption_Enabled) &&
        (config->eccCheckType == kSemcNandEccCheckType_DeviceECC))
    {
        // During READ operations the device executes the internal ECC engine (n-bit detection
        //  and (n-1)-bit error correction). When the READ operaton is complete, read status bit 0 must
        //  be checked to determine whether errors larger than n bits have occurred.
        status_t status = kStatus_Success;
        uint8_t SR = 0;

        // Note1: For MT29 series device: We just need to check SR[PASS] to see the ECC result for
        //  all types of operation(PROGRAM/ERASE/READ)
        // Note2: For S34 series device: Error Detection Code check is a feature that can be used during the
        //  copy back program operation. For common program/erase, the Status Bit SR[PASS] may be checked. The
        //  internal write/erase verify detects only errors for 1’s/0's that are not successfully programmed to 0’s/1's.
        status = semc_nand_issue_read_status(config, &SR);
        if (status == kStatus_Success)
        {
            // SR[PASS] = 0, Successful PROGRAM/ERASE/READ
            // SR[PASS] = 1, Error in PROGRAM/ERASE/READ
            isEccPassed = !(SR & kNandDeviceSR_ONFI_PassBitMask);
        }
        else
        {
            isEccPassed = false;
        }

        // READ MODE command should be issued in case read cycle is folowing.
        status = semc_nand_issue_read_mode(config);
        if (status != kStatus_Success)
        {
            return status;
        }
    }

    return isEccPassed;
}

bool semc_nand_is_mem_blank(uint32_t address, uint32_t length)
{
    const uint8_t *start = (const uint8_t *)address;
    bool isMemoryErased = true;

    while (length)
    {
        if (*start != NAND_MEM_BLANK_VALUE)
        {
            isMemoryErased = false;
            break;
        }
        else
        {
            length--;
            start++;
        }
    }

    return isMemoryErased;
}

status_t semc_nand_read_spare_page_process(semc_nand_config_t *config,
                                           uint32_t ipgCmdAddr,
                                           nand_read_spare_process_t process)
{
    status_t status = kStatus_Success;

    if (s_nandOperationInfo.commandSet == kNandDeviceCmdSet_Specific)
    {
        // For Pre process, issue read_page_spare command
        // For Post process, issue read_page command
        if (process == kNandDeviceReadSpareProcess_Pre)
        {
            status = semc_nand_issue_read_page_spare(config, ipgCmdAddr);
        }
        else if (process == kNandDeviceReadSpareProcess_Post)
        {
            status = semc_nand_issue_read_page(config, ipgCmdAddr);
        }
    }
    else
    {
        // For Pre process, set column address to spare area start
        // For Post process, set column address to page area start
        if (process == kNandDeviceReadSpareProcess_Pre)
        {
            ipgCmdAddr += config->bytesInPageDataArea;
        }
        status = semc_nand_issue_change_read_column(config, ipgCmdAddr);
    }

    return status;
}

status_t semc_nand_read_software_ecc_code_from_spare_area(semc_nand_config_t *config, uint32_t baseAddress)
{
    status_t status = kStatus_Success;

    if ((config->enableEccCheck == kSemcNandEccCheckOption_Enabled) &&
        (config->eccCheckType == kSemcNandEccCheckType_SoftwareECC))
    {
        uint32_t eccBlocks = config->bytesInPageDataArea / config->swEccBlockBytes;
        uint32_t spareAreaStart;
        uint32_t spareAreaArray[NAND_SPARE_AREA_MAX_SIZE / 4];

        assert(config->bytesInPageSpareArea < sizeof(spareAreaArray));
        // Cleanup spare area buffer
        memset(&spareAreaArray, 0xFFu, sizeof(spareAreaArray));

        // Read ECC parity data stored in device spare area
        if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
        {
            uint32_t pageAreaStart = baseAddress / config->memConfig.nandMemConfig.axiMemBaseAddress;
            pageAreaStart *= config->memConfig.nandMemConfig.axiMemBaseAddress;
            spareAreaStart = pageAreaStart + config->bytesInPageDataArea;
            status = semc_axi_memory_read(spareAreaStart, (uint8_t *)spareAreaArray, config->bytesInPageSpareArea);
        }
        else if (config->memConfig.accessCommandType == kSemcAccessCommandType_IPBUSCMD)
        {
            uint32_t pageAreaStart = baseAddress;
            // Set read column address to spare area
            status = semc_nand_read_spare_page_process(config, pageAreaStart, kNandDeviceReadSpareProcess_Pre);
            if (status != kStatus_Success)
            {
                return status;
            }
            status = semc_ipg_memory_read(&config->memConfig, (uint8_t *)spareAreaArray, config->bytesInPageSpareArea, kNandDeviceReadPageData);
            if (status != kStatus_Success)
            {
                return status;
            }
            // Set back read column address to page area
            status = semc_nand_read_spare_page_process(config, pageAreaStart, kNandDeviceReadSpareProcess_Post);
        }
        if (status != kStatus_Success)
        {
            return status;
        }

        // Check if spare area are all blank data
        if (semc_nand_is_mem_blank((uint32_t)&spareAreaArray, sizeof(spareAreaArray)))
        {
            s_nandOperationInfo.isBlankSpareArea = true;
        }
        else
        {
            s_nandOperationInfo.isBlankSpareArea = false;
        }

        // Fill in ECC block with ECC parity data
        memset(&s_nandCommEccParityData, 0, sizeof(s_nandCommEccParityData));
        {
            assert(eccBlocks <= NAND_ECC_MAX_BLOCKS);
            nand_page_spare_area_t *spareArea = (nand_page_spare_area_t *)spareAreaArray;
            uint32_t eccIndex = 0;
            while (eccIndex < eccBlocks)
            {
                s_nandCommEccParityData.block[eccIndex] = spareArea->unit8Byte[eccIndex].eccParityData;
                eccIndex++;
            }
        }
    }

