Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1176/src/semc_nand_flash_MIMXRT1176.c
    // Issues the page program command to device
    status = semc_nand_issue_program_page(config, ipgCmdAddr, kNandDeviceProgramProcess_Post);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Check NAND Device ECC status if applicable
    if (!semc_nand_is_device_ecc_check_passed(config))
    {
        return kStatus_SemcNAND_EccCheckFail;
    }

    if (config->enableReadbackVerify == kSemcNandReadbackVerifyOption_Enabled)
    {
        // Readback data to verify program
        status = semc_nand_flash_verify_page_program(config, pageIndex, src, length);
    }

    return status;
}

//!@brief Erase blocks of the Parallel NAND devices connected on SEMC
status_t semc_nand_flash_erase_block(semc_nand_config_t *config, uint32_t blockIndex)
{
    status_t status = kStatus_Success;
    uint32_t ipgCmdAddr;

    ipgCmdAddr = blockIndex * config->pagesInBlock * config->bytesInPageDataArea;
    // Validate given blockIndex
    if (ipgCmdAddr >= config->memConfig.nandMemConfig.ipgMemSizeInByte)
    {
        return kStatus_SemcNAND_InvalidMemoryAddress;
    }

    // Calculate the slave address for ipg command
    // Note NA2.2: the below ipgCmdAddr must be byte address no matter it is x8
    //  or x16 device, see Note NA1.1 for reason
    ipgCmdAddr = semc_ipg_command_convert_nand_address(&config->memConfig, ipgCmdAddr);
    s_nandOperationInfo.rowAddressToGetSR = ipgCmdAddr;

    // Issues the block erase command to device
    status = semc_nand_issue_erase_block(config, ipgCmdAddr);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Check NAND Device ECC status if applicable
    if (!semc_nand_is_device_ecc_check_passed(config))
    {
        return kStatus_SemcNAND_EccCheckFail;
    }

    if (config->enableReadbackVerify == kSemcNandReadbackVerifyOption_Enabled)
    {
        // Readback data to verify erase
        uint32_t pageIndex = blockIndex * config->pagesInBlock;
        status = semc_nand_flash_verify_erase(config, pageIndex, config->pagesInBlock);
    }

    return kStatus_Success;
}

// Verify erase on Parallel NAND Flash device
status_t semc_nand_flash_verify_erase(semc_nand_config_t *config, uint32_t pageIndex, uint32_t pageCount)
{
    status_t status;
    uint8_t *dest = (uint8_t *)config->readbackPageBufferAddress;

    if (dest == NULL)
    {
        return kStatus_SemcNAND_InvalidReadbackBuffer;
    }

    while (pageCount--)
    {
        status = semc_nand_flash_read_page(config, pageIndex, dest, config->bytesInPageDataArea);
        if (status != kStatus_Success)
        {
            return status;
        }

        if (!semc_nand_is_mem_blank((uint32_t)dest, config->bytesInPageDataArea))
        {
            return kStatus_SemcNAND_EraseVerifyFailure;
        }
        pageIndex++;
    }

    return kStatus_Success;
}

// Verify program on Parallel NAND Flash device
status_t semc_nand_flash_verify_page_program(semc_nand_config_t *config,
                                             uint32_t pageIndex,
                                             const uint8_t *src,
                                             uint32_t lengthInBytes)
{
    status_t status;
    uint8_t *dest = (uint8_t *)config->readbackPageBufferAddress;

    if (dest == NULL)
    {
        return kStatus_SemcNAND_InvalidReadbackBuffer;
    }

    status = semc_nand_flash_read_page(config, pageIndex, dest, lengthInBytes);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (memcmp(src, dest, lengthInBytes))
    {
        return kStatus_SemcNAND_ProgramVerifyFailure;
    }

    return kStatus_Success;
}

////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
